Emacs/.emacs.d/Emacs.org
#+TITLE: My GNU Emacs Configuration
#+AUTHOR: Oliver Nikolas Winspear
#+DATE: <2022-03-31 Thu>
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: content

* Preamble
This is my GNU Emacs configuration, written in Org Mode. Upon saving this file, all of the following code blocks are added to ~init.el~ using ~org-babel-tangle~. I got the code snippet for this from David Wilson's [[https://github.com/daviwil/emacs-from-scratch][Emacs from Scratch]] GitHub repository.

* Basic Configuration
** Startup
Improve startup speed by increasing ~gc-cons-threshold~. Its original value is restored after startup for safety.
#+begin_src emacs-lisp
  ;; Use 100MB of consing between garbage collections
  (setq gc-cons-threshold (* 100 1000 1000))

  (add-hook 'after-init-hook (lambda ()
                               ;; Restore value after startup
                               (setq gc-cons-threshold 800000)))
#+end_src

** Default Coding System
#+begin_src emacs-lisp
  (set-default-coding-systems 'utf-8)
#+end_src

** User Emacs Directory
#+begin_src emacs-lisp
  (setq user-emacs-directory "~/stow/Emacs/.emacs.d/")
#+end_src

** Load Path
#+begin_src emacs-lisp
  (push (concat user-emacs-directory "lisp/") load-path)
#+end_src

** Package Management
I use Straight instead of the built-in ~package.el~.
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Install use-package and use it by default
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+end_src

** No Littering
~no-littering~ makes Emacs packages store their configuration files and persistent data in the ~etc/~ and ~var/~ subdirectories of ~user-emacs-directory~. This package should be loaded before changes have been made to any path variables.
#+begin_src emacs-lisp
  (use-package no-littering)

  ;; Store backup and auto-save files in the var/ directory
  (setq backup-directory-alist `(("" . ,(no-littering-expand-var-file-name "emacs-backup/"))))
  (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

  ;; Store the custom file in the etc/directory
  (setq custom-file (no-littering-expand-etc-file-name "custom.el"))
#+end_src

** systemd Emacs Service
Some functions for managing the systemd user service for Emacs.
#+begin_src emacs-lisp
  (defun olnw/systemd-restart-emacs ()
    (interactive)
    (save-some-buffers)
    (shell-command "systemctl --user restart emacs"))

  (defun olnw/systemd-stop-emacs ()
    (interactive)
    (save-some-buffers)
    (shell-command "systemctl --user stop emacs"))
#+end_src

* User Interface
** Visual
*** Themes
#+begin_src emacs-lisp
  (use-package moe-theme
    ;;:init
    ;;(defvar moe-theme-mode-line-color 'yellow)
    :config
    (setq moe-theme-highlight-buffer-id t))

  (use-package emacs
    :init
    ;; Add customisations prior to loading the themes
    (setq modus-themes-italic-constructs t
          modus-themes-bold-constructs nil
          modus-themes-region '(bg-only no-extend))

    ;; Treat all themes as safe
    (setq custom-safe-themes t))

  ;; Make comments more visible
  ;;(set-face-foreground 'font-lock-comment-face "pink")

  ;; Packaged version of the Modus themes, for older Emacs versions
  ;; that don't have them installed by default.
  (use-package modus-themes
    :init (modus-themes-load-themes)
    :config (modus-themes-load-vivendi))
#+end_src

*** Reduce Visual Clutter
This code hides the menu bar, tool bar, and scroll bar. It also prevents the unattractive startup screen from showing.
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq inhibit-startup-screen t)
#+end_src

*** Custom Faces
#+begin_src emacs-lisp
  (defun olnw/set-faces ()
    (set-face-attribute 'default nil :family "JetBrains Mono" :height 120 :weight 'light)
    (set-face-attribute 'fixed-pitch nil :family "JetBrains Mono" :height 120 :weight 'light)
    (set-face-attribute 'variable-pitch nil :family "FiraGO" :height 120 :weight 'light)
    (set-face-attribute 'fill-column-indicator nil :background "white" :foreground "white")
    (set-fontset-font t 'symbol "Noto Color Emoji")

    (defgroup olnw-faces nil "Faces created by Oliver Winspear" :group 'faces)
    (defface olnw/org-bullets-face
      '((t :font "Symbola" :height 120))
      "Face for org-bullets-mode"
      :group 'olnw-faces)

    ;; Make sure the faces are only set once
    (remove-hook 'server-after-make-frame-hook #'olnw/set-faces))

  (if (daemonp)
      (add-hook 'server-after-make-frame-hook #'olnw/set-faces)
    (add-hook 'after-init-hook #'olnw/set-faces))
#+end_src

*** Mixed Pitch Mode
This mode automatically decides whether regions of a buffer should be displayed with fixed or variable-pitch fonts. With ~mixed-pitch-mode~ active, Babel source blocks and Org tables are displayed with a fixed-pitch font, whereas other text is displayed with a variable-pitch font.
#+begin_src emacs-lisp
  (use-package mixed-pitch
    ;;:hook (org-mode . mixed-pitch-mode)
    :config
    (setq mixed-pitch-set-height t))
#+end_src

*** All The Icons
For this to work, run ~M-x all-the-icons-install-fonts~.
#+begin_src emacs-lisp
  (use-package all-the-icons)
  (use-package all-the-icons-dired :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

*** Mode Line
~doom-modeline~ requires icons from All The Icons.
#+begin_src emacs-lisp
  (use-package doom-modeline :config (doom-modeline-mode 1))

  ;; Display the column number in the mode line
  (column-number-mode 1)

  ;; Display Nyan Cat in the modeline
  ;; This is necessary; trust me.
  (use-package nyan-mode :config (nyan-mode))
#+end_src

*** Visualise Blanks
#+begin_src emacs-lisp
  (setq whitespace-style '(tab-mark))
  (global-whitespace-mode)
#+end_src

*** Line Numbers
Show line numbers in ~prog-mode~.
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
#+end_src

*** Pulsar
#+begin_src emacs-lisp
  (use-package pulsar
    :defer 3
    :config
    (setq pulsar-face 'pulsar-magenta)
    (pulsar-global-mode 1))

  ;; Pulse the line after jumping somewhere with avy.
  (defadvice avy-action-goto (after avy-pulse-after-goto activate)
    (pulsar-pulse-line))
#+end_src

*** Rainbow Delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook
    ((prog-mode . rainbow-delimiters-mode)
     (sly-mrepl . rainbow-delimiters-mode))
    :custom-face
    (rainbow-delimiters-depth-1-face ((t (:foreground "dark orange"))))
    (rainbow-delimiters-depth-2-face ((t (:foreground "deep pink"))))
    (rainbow-delimiters-depth-3-face ((t (:foreground "chartreuse")))) ; dark red
    (rainbow-delimiters-depth-4-face ((t (:foreground "deep sky blue"))))
    (rainbow-delimiters-depth-5-face ((t (:foreground "yellow")))) ; black
    (rainbow-delimiters-depth-6-face ((t (:foreground "orchid"))))
    (rainbow-delimiters-depth-7-face ((t (:foreground "spring green"))))
    (rainbow-delimiters-depth-8-face ((t (:foreground "sienna1"))))
    (whitespace-tab ((t (:foreground "#636363")))))
#+end_src

*** Show Matching Parentheses
#+begin_src emacs-lisp
  (setq show-paren-delay 0)
  (setq show-paren-style 'expression)
  (show-paren-mode 1)
#+end_src

** Key Bindings
*** Inserting Special Symbols
~typo-mode~ allows the user to insert typographical symbols using a regular keyboard. For example, pressing the minus/underscore key will cycle between the hyphen (-), the en dash (–), and the em dash (—). An equivalent of ~eldoc-prog-mode~ for ~typo~ would be useful.
#+begin_src emacs-lisp
  (use-package typo :defer 3)
#+end_src

*** Major Mode Hydra
#+begin_src emacs-lisp
  (use-package major-mode-hydra)
#+end_src

*** which-key
#+begin_src emacs-lisp
  (use-package which-key :config (which-key-mode))
#+end_src

*** New Empty Buffer
#+begin_src emacs-lisp
  (defun xah/new-empty-buffer ()
    "Create a new empty buffer.
  New buffer will be named “untitled” or “untitled<2>”, “untitled<3>”, etc.

  It returns the buffer (for elisp programing).

  URL `http://xahlee.info/emacs/emacs/emacs_new_empty_buffer.html'
  Version 2017-11-01"
    (interactive)
    (let (($buf (generate-new-buffer "untitled")))
      (switch-to-buffer $buf)
      (funcall initial-major-mode)
      (setq buffer-offer-save t)
      $buf))

  (global-set-key (kbd "<f5>") #'xah/new-empty-buffer)
#+end_src

*** Open The Configuration File
#+begin_src emacs-lisp
  (global-set-key (kbd "s-i") (lambda ()
                                (interactive)
                                (find-file (concat user-emacs-directory "Emacs.org"))))
#+end_src

*** Modal Editing
**** Evil
I used Evil for a while (as a former Vim user), but was frustrated by its lack of compatibility with certain Emacs packages. Now that I’m using the default Emacs bindings, I no longer have to check whether a package has been added to ~evil-collection~ before I install it.

