Emacs/.emacs.d/init.el
;; Use 100MB of consing between garbage collections
(setq gc-cons-threshold (* 100 1000 1000))

(add-hook 'after-init-hook (lambda ()
                             ;; Restore value after startup
                             (setq gc-cons-threshold 800000)))

(set-default-coding-systems 'utf-8)

(setq user-emacs-directory "~/stow/Emacs/.emacs.d/")

(push (concat user-emacs-directory "lisp/") load-path)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Install use-package and use it by default
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(use-package no-littering)

;; Store backup and auto-save files in the var/ directory
(setq backup-directory-alist `(("" . ,(no-littering-expand-var-file-name "emacs-backup/"))))
(setq auto-save-file-name-transforms
    `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

;; Store the custom file in the etc/directory
(setq custom-file (no-littering-expand-etc-file-name "custom.el"))

(defun olnw/systemd-restart-emacs ()
  (interactive)
  (save-some-buffers)
  (shell-command "systemctl --user restart emacs"))

(defun olnw/systemd-stop-emacs ()
  (interactive)
  (save-some-buffers)
  (shell-command "systemctl --user stop emacs"))

(use-package moe-theme
  ;;:init
  ;;(defvar moe-theme-mode-line-color 'yellow)
  :config
  (setq moe-theme-highlight-buffer-id t))

(use-package emacs
  :init
  ;; Add customisations prior to loading the themes
  (setq modus-themes-italic-constructs t
        modus-themes-bold-constructs nil
        modus-themes-region '(bg-only no-extend))

  ;; Treat all themes as safe
  (setq custom-safe-themes t))

;; Make comments more visible
;;(set-face-foreground 'font-lock-comment-face "pink")

;; Packaged version of the Modus themes, for older Emacs versions
;; that don't have them installed by default.
(use-package modus-themes
  :init (modus-themes-load-themes)
  :config (modus-themes-load-vivendi))

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-screen t)

(defun olnw/set-faces ()
  (set-face-attribute 'default nil :family "JetBrains Mono" :height 120 :weight 'light)
  (set-face-attribute 'fixed-pitch nil :family "JetBrains Mono" :height 120 :weight 'light)
  (set-face-attribute 'variable-pitch nil :family "FiraGO" :height 120 :weight 'light)
  (set-face-attribute 'fill-column-indicator nil :background "white" :foreground "white")
  (set-fontset-font t 'symbol "Noto Color Emoji")

  (defgroup olnw-faces nil "Faces created by Oliver Winspear" :group 'faces)
  (defface olnw/org-bullets-face
    '((t :font "Symbola" :height 120))
    "Face for org-bullets-mode"
    :group 'olnw-faces)

  ;; Make sure the faces are only set once
  (remove-hook 'server-after-make-frame-hook #'olnw/set-faces))

(if (daemonp)
    (add-hook 'server-after-make-frame-hook #'olnw/set-faces)
  (add-hook 'after-init-hook #'olnw/set-faces))

(use-package mixed-pitch
  ;;:hook (org-mode . mixed-pitch-mode)
  :config
  (setq mixed-pitch-set-height t))

(use-package all-the-icons)
(use-package all-the-icons-dired :hook (dired-mode . all-the-icons-dired-mode))

(use-package doom-modeline :config (doom-modeline-mode 1))

;; Display the column number in the mode line
(column-number-mode 1)

;; Display Nyan Cat in the modeline
;; This is necessary; trust me.
(use-package nyan-mode :config (nyan-mode))

(setq whitespace-style '(tab-mark))
(global-whitespace-mode)

(add-hook 'prog-mode-hook #'display-line-numbers-mode)

(use-package pulsar
  :defer 3
  :config
  (setq pulsar-face 'pulsar-magenta)
  (pulsar-global-mode 1))

;; Pulse the line after jumping somewhere with avy.
(defadvice avy-action-goto (after avy-pulse-after-goto activate)
  (pulsar-pulse-line))

(use-package rainbow-delimiters
  :hook
  ((prog-mode . rainbow-delimiters-mode)
   (sly-mrepl . rainbow-delimiters-mode))
  :custom-face
  (rainbow-delimiters-depth-1-face ((t (:foreground "dark orange"))))
  (rainbow-delimiters-depth-2-face ((t (:foreground "deep pink"))))
  (rainbow-delimiters-depth-3-face ((t (:foreground "chartreuse")))) ; dark red
  (rainbow-delimiters-depth-4-face ((t (:foreground "deep sky blue"))))
  (rainbow-delimiters-depth-5-face ((t (:foreground "yellow")))) ; black
  (rainbow-delimiters-depth-6-face ((t (:foreground "orchid"))))
  (rainbow-delimiters-depth-7-face ((t (:foreground "spring green"))))
  (rainbow-delimiters-depth-8-face ((t (:foreground "sienna1"))))
  (whitespace-tab ((t (:foreground "#636363")))))

(setq show-paren-delay 0)
(setq show-paren-style 'expression)
(show-paren-mode 1)

(use-package typo :defer 3)

(use-package major-mode-hydra)

(use-package which-key :config (which-key-mode))

(defun xah/new-empty-buffer ()
  "Create a new empty buffer.
New buffer will be named “untitled” or “untitled<2>”, “untitled<3>”, etc.

It returns the buffer (for elisp programing).

URL `http://xahlee.info/emacs/emacs/emacs_new_empty_buffer.html'
Version 2017-11-01"
  (interactive)
  (let (($buf (generate-new-buffer "untitled")))
    (switch-to-buffer $buf)
    (funcall initial-major-mode)
    (setq buffer-offer-save t)
    $buf))

(global-set-key (kbd "<f5>") #'xah/new-empty-buffer)

(global-set-key (kbd "s-i") (lambda ()
                              (interactive)
                              (find-file (concat user-emacs-directory "Emacs.org"))))
