Emacs/.emacs.d/Emacs.org
**** Meow
I use Meow for modal editing. Perhaps I can combine it with [[https://karthinks.com/software/avy-can-do-anything/][Avy]] for increased efficiency, although it already seems quite powerful by itself. My keyboard layout is the standard ANSI variant of Colemak-DH.
#+begin_src emacs-lisp
  (use-package meow
    :config
    (setq meow-expand-hint-remove-delay 100)

    (defun meow-setup ()
      ;; No cheatsheet for Colemak-DH :(
      (setq meow-cheatsheet-layout meow-cheatsheet-layout-colemak)
      (meow-motion-overwrite-define-key
       '("<escape>" . ignore)
       '("e" . meow-next)
       '("i" . meow-prev))
      (meow-leader-define-key
       '("?" . meow-cheatsheet)
       ;; To execute the originally e in MOTION state, use SPC e.
       '("e" . "H-e")
       '("1" . meow-digit-argument)
       '("2" . meow-digit-argument)
       '("3" . meow-digit-argument)
       '("4" . meow-digit-argument)
       '("5" . meow-digit-argument)
       '("6" . meow-digit-argument)
       '("7" . meow-digit-argument)
       '("8" . meow-digit-argument)
       '("9" . meow-digit-argument)
       '("0" . meow-digit-argument))
      (meow-normal-define-key
       '("`" . ace-window)
       '("0" . meow-expand-0)
       '("1" . meow-expand-1)
       '("2" . meow-expand-2)
       '("3" . meow-expand-3)
       '("4" . meow-expand-4)
       '("5" . meow-expand-5)
       '("6" . meow-expand-6)
       '("7" . meow-expand-7)
       '("8" . meow-expand-8)
       '("9" . meow-expand-9)
       '("-" . negative-argument)
       '(";" . meow-reverse)
       '("," . meow-inner-of-thing)
       '("." . meow-bounds-of-thing)
       '("[" . meow-beginning-of-thing)
       '("]" . meow-end-of-thing)
       '("/" . meow-visit)
       '("a" . meow-append)
       '("A" . meow-open-below)
       '("b" . meow-back-word)
       '("B" . meow-back-symbol)
       '("c" . meow-change)
       '("d" . meow-delete)
       '("e" . meow-next)
       '("E" . meow-next-expand)
       '("f" . meow-find)
       '("g" . meow-cancel-selection)
       '("G" . meow-grab)
       '("h" . execute-extended-command)
       '("H" . repeat)
       '("i" . meow-prev)
       '("I" . meow-prev-expand)
       '("j" . meow-join)
       '("k" . meow-kill)
       '("l" . meow-line)
       '("L" . meow-goto-line)
       '("m" . meow-mark-word)
       '("M" . meow-mark-symbol)
       '("n" . meow-left)
       '("N" . meow-left-expand)
       '("o" . meow-right)
       '("O" . meow-right-expand)
       '("p" . meow-yank)
       '("q" . meow-quit)
       '("r" . meow-replace)
       '("s" . meow-insert)
       '("S" . meow-open-above)
       '("t" . meow-till)
       '("u" . meow-undo)
       '("U" . meow-undo-in-selection)
       '("v" . meow-search)
       '("w" . meow-next-word)
       '("W" . meow-next-symbol)
       '("x" . meow-delete)
       '("X" . meow-backward-delete)
       '("y" . meow-save)
       '("z" . meow-pop-selection)
       '("'" . meow-block)
       '("\"" . meow-to-block)
       '("<escape>" . ignore)))
    (meow-setup)
    (meow-global-mode))
#+end_src

*** Making Better Use of Caps Lock
The Caps Lock key is easily accessible from the home row on an ANSI keyboard. As such, I believe it should be re-mapped to serve a more useful purpose. It's common for Emacs users to bind it to Control, however there is a better option. With tools such as KMonad, xcape, keyd, Xremap and Interception Tools, it is possible to assign multiple functions to a single physical key. Since Control is only useful as a leader key, I have assigned the Caps Lock key to function as Escape when tapped, and Control when held. This is useful for Vim/Neovim, to avoid moving my left hand from the home row when I want to exit Insert Mode.

