Emacs/.emacs.d/init.el

(use-package ace-window)

(use-package avy
  :config (avy-setup-default)
  :bind
  ("H-:"   . 'avy-goto-char)
  ("H-'"   . 'avy-goto-char-2)
  ("H-g f" . 'avy-goto-line)
  ("H-g w" . 'avy-goto-word-1)
  ("H-g e" . 'avy-goto-word-0))

(use-package projectile
  :defer 3
  :config
  (projectile-global-mode)
  (define-key projectile-mode-map (kbd "H-p") 'projectile-command-map))

(setq auto-window-vscroll nil) ; Potentially fixes jumpy scrolling
(setq scroll-conservatively 1000) ; Don't recenter the point if it moves off screen
(setq mouse-wheel-scroll-amount '(4)) ; Scroll four lines at a time with the mouse wheel
(setq mouse-wheel-progressive-speed nil) ; Non-accelerated mouse wheel scrolling

;;(use-package good-scroll :config (good-scroll-mode 1))

(pretty-hydra-define hydra-applications (:quit-key "q" :color teal)
  ("Applications" (("l" libera-chat "Connect to Libera Chat with ERC")
                   ("e" elfeed "Elfeed")
                   ("v" vterm-other-window "vterm")
                   ("q" nil "Quit"))))

(global-set-key (kbd "H-a") 'hydra-applications/body)

(use-package erc
  :defer 3
  :straight (:type built-in)
  :config
  (setq erc-nick "olnw")
  (setq erc-prompt-for-password nil)
  (setq erc-prompt-for-nickserv-password nil)

  (defun libera-chat ()
        (interactive)
        (erc-tls :server "irc.au.libera.chat"
                 :port   "6697")))

(use-package pdf-tools
  :defer 3
  :config
  (setq pdf-view-midnight-colors `(,(face-attribute 'default :foreground) .
                                   ,(face-attribute 'default :background)))

  (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))

  (add-hook 'pdf-view-mode-hook (lambda ()
                                  (pdf-view-midnight-minor-mode)
                                  (auto-revert-mode)))) ; Display changes live

(use-package pdf-view-restore
  :defer 3
  :after pdf-tools
  :config
  (add-hook 'pdf-view-mode-hook #'pdf-view-restore-mode)

  ;; Save information to a custom location
  (setq pdf-view-restore-filename (concat user-emacs-directory ".pdf-view-restore")))

(defun prot-common-crm-exclude-selected-p (input)
  "Filter out INPUT from `completing-read-multiple'.
Hide non-destructively the selected entries from the completion
table, thus avoiding the risk of inputting the same match twice.

To be used as the PREDICATE of `completing-read-multiple'."
  (if-let* ((pos (string-match-p crm-separator input))
            (rev-input (reverse input))
            (element (reverse
                      (substring rev-input 0
                                 (string-match-p crm-separator rev-input))))
            (flag t))
      (progn
        (while pos
          (if (string= (substring input 0 pos) element)
              (setq pos nil)
            (setq input (substring input (1+ pos))
                  pos (string-match-p crm-separator input)
                  flag (when pos t))))
        (not flag))
    t))

(defun prot-elfeed-search-tag-filter ()
  "Filter Elfeed search buffer by tags using completion.

Completion accepts multiple inputs, delimited by `crm-separator'.
Arbitrary input is also possible, but you may have to exit the
minibuffer with something like `exit-minibuffer'."
  (interactive)
  (unwind-protect
      (elfeed-search-clear-filter)
    (let* ((elfeed-search-filter-active :live)
           (db-tags (elfeed-db-get-all-tags))
           (plus-tags (mapcar (lambda (tag)
                                (format "+%s" tag))
                              db-tags))
           (minus-tags (mapcar (lambda (tag)
                                 (format "-%s" tag))
                               db-tags))
           (all-tags (delete-dups (append plus-tags minus-tags)))
           ;; REQUIRE-MATCH is set to nil to allow arbitrary input
           (tags (completing-read-multiple
                  "Apply one or more tags: "
                  all-tags #'prot-common-crm-exclude-selected-p nil))
           (input (string-join `(,elfeed-search-filter ,@tags) " ")))
      (setq elfeed-search-filter input))
    (elfeed-search-update :force)))

(use-package elfeed
  :defer 3
  :config
  ;; Load my feeds from a separate file
  (load "olnw-elfeed-feeds.el")

  ;; Customise the default filter
  (elfeed-search-set-filter "+unread")
  (setq elfeed-search-title-max-width 100)

  (defun olnw/play-with-mpv ()
    (interactive)
    (let* ((entries (elfeed-search-selected))
           (links (mapcar #'elfeed-entry-link entries)))

      ;; Mark selected entries as read
      (elfeed-search-untag-all-unread)

      ;; Play all selected entries with mpv
      (cl-loop for link in links
               do (call-process-shell-command (concat "mpv '" link "' \&") nil 0))))

  :bind (:map elfeed-search-mode-map
              ("C-c C-o" . olnw/play-with-mpv)
              ("s"       . prot-elfeed-search-tag-filter)))

(use-package vterm :defer 3)

(setq backward-delete-char-untabify-method 'hungry)

;; Display tab characters with a max width of 8 columns.
;; This is unaffected by indent-tabs-mode.
(setq-default tab-width 8)

;; By default, don't allow indentation to insert tabs.
(setq-default indent-tabs-mode nil)

;; Auto-indentation
(electric-indent-mode 1)

;; Disable in Org mode. It was behaving weirdly for me.
(add-hook 'org-mode-hook
          (lambda () (electric-indent-local-mode -1)))

;; Indent with tabs for HTML and CSS
(setq sgml-basic-offset tab-width)
(setq css-indent-offset tab-width)
(add-hook 'html-mode-hook (lambda () (setq indent-tabs-mode t)))
(add-hook 'css-mode-hook (lambda () (setq indent-tabs-mode t)))

;; [[https://stackoverflow.com/questions/39894233/extract-emacs-c-style-options-from-clang-format-style][Getting CC mode style options from a clang-format file]]:
;; https://stackoverflow.com/q/39894233

;; Set the indentation style for CC mode.
(setq c-default-style
  '((java-mode . "java")
    (awk-mode  . "awk")
    (other     . "gnu")))

(use-package aggressive-indent
  :hook ((emacs-lisp-mode . aggressive-indent-mode)
         (lisp-mode       . aggressive-indent-mode)))

(use-package highlight-indent-guides
  :hook (prog-mode . highlight-indent-guides-mode)
  :config
  (setq highlight-indent-guides-method 'character))

;; Doesn't seem to be working, even though org-eldoc-documentation-function
;; is added to eldoc-documentation-functions when in Org mode. I'll just
;; leave this here until it starts working or I know how to fix it.
(use-package org-contrib)
(require 'org-eldoc)

(use-package magit :defer 3)
