Emacs/.emacs.d/Emacs.org
*** Lisp
I don't use Lispy, because I don't imagine it would work well with Meow.
#+begin_src emacs-lisp
  (setq inferior-lisp-program "ros -Q run")

  (use-package paredit
    :hook ((emacs-lisp-mode                  . enable-paredit-mode)
           (eval-expression-minibuffer-setup . enable-paredit-mode)
           (ielm-mode                        . enable-paredit-mode)
           (lisp-mode                        . enable-paredit-mode)
           (lisp-interaction-mode            . enable-paredit-mode)
           (scheme-mode                      . enable-paredit-mode)
           (sly-mrepl                        . enable-paredit-mode)))

  (use-package sly
    :config
    (require 'sly-autoloads)
    (setq sly-contribs '(sly-mrepl))
    (sly-setup)

    ;; Disable Sly's completion UI. I use Corfu instead.
    (sly-symbol-completion-mode -1))

  (defun olnw/lisp-setup ()
    (setq fill-column 100))

  (add-hook 'lisp-mode-hook #'olnw/lisp-setup)
  (add-hook 'emacs-lisp-mode-hook #'olnw/lisp-setup)
#+end_src

** LSP and DAP
#+begin_src emacs-lisp
  (use-package lsp-mode
    :init
    ;; Set prefix for lsp-command-keymap
    (setq lsp-keymap-prefix "s-l")
    :hook ((python-mode . lsp)
           (c-mode      . lsp)
           (c++-mode    . lsp)
           (lsp-mode    . lsp-enable-which-key-integration))
    :bind (:map lsp-mode-map ("<tab>" . indent-for-tab-command)))

  (use-package lsp-ui)

  (use-package dap-mode
    :config
    (add-hook 'dap-stopped-hook
              (lambda (arg) (call-interactively #'dap-hydra))))
#+end_src

* Writing and Productivity
** LaTeX
I use ~latexmk-mode~, which I found [[https://reddit.com/r/emacs/comments/k7sx2n/latexpreviewpane_and_latexmk/][here]]. Maybe I’ll try to improve it in the future.
#+begin_src emacs-lisp
  ;;(load "latexmk-mode.el")
  ;;(add-hook 'LaTeX-mode-hook #'latexmk-mode)
#+end_src

** Org Mode
Org is a major mode for Emacs. It does a lot of things — I use it for note-taking, writing, to manage my personal projects, and to track my daily habits with the ~org-habit~ module. These habits pop up on my agenda each day, with a little coloured graph that shows my consistency.
#+begin_src emacs-lisp
  (use-package org
    :straight (:type built-in)
    :bind (:map global-map
                ("\C-cl" . org-store-link)
                ("\C-ca" . org-agenda)
           :map org-mode-map
                ("C-'"   . nil)) ; I use this binding for avy-goto-char-2

    :config
    (setq org-hide-emphasis-markers t)
    (setq org-startup-indented t) ; Globally turn on Org Indent mode
    (setq org-log-done t)

    (setq org-directory "/mnt/hdd/org")

    ;; I can’t figure out how to match either .org or .org.gpg files
    ;; Fix this in the future
    (setq org-agenda-file-regexp "\\`[^.].*\\.org.gpg\\'")
    (setq org-agenda-files (list org-directory))

    (push 'org-habit org-modules) ; Add org-habit to the list of modules

    (setq org-hide-leading-stars t)

    ;; Change the colour of the face that's used to hide leading stars
    ;; The value should be #303030 for the moe-dark theme
    (set-face-attribute 'org-hide nil :foreground "#000000")

    (add-hook 'org-mode-hook (lambda ()
                               (setq fill-column 100)
                               (visual-line-mode))))
#+end_src

*** Babel
#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        (lisp       . t)
        (python     . t))))
#+end_src

*** Structure Templates
Easily insert code blocks into Org files by typing a less-than sign, followed by the desired template name. Pressing ~TAB~ will then create an empty code block.
#+begin_src emacs-lisp
  ;; This is needed as of Org 9.2
  (require 'org-tempo)
  
  (add-to-list 'org-structure-template-alist '("sh"   . "src sh"))
  (add-to-list 'org-structure-template-alist '("el"   . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sc"   . "src scheme"))
  (add-to-list 'org-structure-template-alist '("ts"   . "src typescript"))
  (add-to-list 'org-structure-template-alist '("py"   . "src python"))
  (add-to-list 'org-structure-template-alist '("go"   . "src go"))
  (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
  (add-to-list 'org-structure-template-alist '("json" . "src json"))
#+end_src

*** Auto-tangle Configuration Files
#+begin_src emacs-lisp
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name user-emacs-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

*** Centre Text
#+begin_src emacs-lisp
  (use-package visual-fill-column
    :hook (org-mode . visual-fill-column-mode)
    :init
    (setq visual-fill-column-center-text t)
    (setq visual-fill-column-width 100))
#+end_src

*** org-bullets
This package allows the user to customise the appearance of Org headline markers (the asterisks at start of an Org headline).
#+begin_src emacs-lisp
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :config
    (setq org-bullets-bullet-list '("☯" "○" "✸" "✿" "~"))
    (setq org-bullets-face-name 'olnw/org-bullets-face))
#+end_src

*** org-roam
I use ~org-roam~ for Zettelkasten note-taking and daily journaling.
#+begin_src emacs-lisp
  (use-package org-roam
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "/mnt/hdd/org-roam")
    ;; Completion without using double square brackets
    (org-roam-completion-everywhere t)
    :config
    (setq org-roam-capture-templates '(("d" "default" plain "%?"
      :target (file+head "${slug}.org.gpg"
                         "#+title: ${title}\n")
      :unnarrowed t)))
    (org-roam-db-autosync-mode))

  ;; 'Collection of functions to operate org-roam with the help of
  ;; consult and its live preview feature.'
  (use-package consult-org-roam
    :init
    (require 'consult-org-roam)
    ;; Activate the minor-mode
    (consult-org-roam-mode 1)
    :custom
    (consult-org-roam-grep-func #'consult-ripgrep)
    :config
    ;; Eventually suppress previewing for certain functions
    (consult-customize
     consult-org-roam-forward-links
     :preview-key (kbd "M-."))
    :bind
    ("C-c n f" . org-roam-node-find) ; Can't create new nodes with consult-org-roam-file-find?
    ("C-c n b" . consult-org-roam-backlinks)
    ("C-c n s" . consult-org-roam-search)
    ("C-c n l" . org-roam-buffer-toggle)
    ("C-c n i" . org-roam-node-insert))
#+end_src
